from Maze import (
    Maze,
)

class Player:
    """Класс, представляющий игрока в лабиринте."""
    
    SYMBOL = "😨"

    def __init__(self, start_x: int, start_y: int):
        """
        Инициализирует игрока с начальной позицией.
        
        Args:
            start_x (int): Начальная x-координата игрока
            start_y (int): Начальная y-координата игрока
        """

        self.x = start_x
        self.y = start_y

    def move(self, dx: int, dy: int, maze: Maze) -> None:
        """
        Перемещает игрока в указанном направлении, если это возможно.
        
        Args:
            dx (int): Изменение по оси X (-1, 0, 1)
            dy (int): Изменение по оси Y (-1, 0, 1)
            maze (Maze): Объект лабиринта для проверки проходимости
        """
        
        nx, ny = self.x + dx, self.y + dy
        
        if maze.is_walkable(nx, ny):
            self.x, self.y = nx, ny
